saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/NXP.MKL17Z4_DFP.11.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKL17Z4_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKL17Z4</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="MKL17Z4" Dvendor="NXP:11">
      <description>The Kinetis® KL1x is a general purpose ultra-low-power MCU family, providing additional memory, communications and analog peripheral options beyond those offered in the Kinetis KL0x MCU family.The KL1x MCU family is compatible with Kinetis K10 MCUs (based on ARM® Cortex®-M4) and with all other Kinetis KL1x, KL2x, KL3x and KL4x series MCUs, providing a migration path to higher performance and feature integration.</description>
      <device Dname="MKL17Z128xxx4">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dendian="Little-endian" Dclock="48000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKL17Z128xxx4_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x020000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1fffe000" size="0x8000" access="rw" default="1"/>
        <algorithm name="arm/MK_P128_48MHZ_KL43.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1ffff000" RAMsize="0x00000800" default="1"/>
        <debug svd="MKL17Z4.xml"/>
        <variant Dvariant="MKL17Z128VFT4">
          <compile header="fsl_device_registers.h" define="CPU_MKL17Z128VFT4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL17Z128VFT4/MKL17Z128xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL17Z128VLH4">
          <compile header="fsl_device_registers.h" define="CPU_MKL17Z128VLH4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL17Z128VLH4/MKL17Z128xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL17Z128VFM4">
          <compile header="fsl_device_registers.h" define="CPU_MKL17Z128VFM4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL17Z128VFM4/MKL17Z128xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL17Z128VMP4">
          <compile header="fsl_device_registers.h" define="CPU_MKL17Z128VMP4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL17Z128VMP4/MKL17Z128xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MKL17Z256xxx4">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dendian="Little-endian" Dclock="48000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKL17Z256xxx4_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x040000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1fffe000" size="0x8000" access="rw" default="1"/>
        <algorithm name="arm/MK_P256_48MHZ_KL43.FLM" start="0x00000000" size="0x00040000" RAMstart="0x1ffff000" RAMsize="0x00000800" default="1"/>
        <debug svd="MKL17Z4.xml"/>
        <variant Dvariant="MKL17Z256VFM4">
          <compile header="fsl_device_registers.h" define="CPU_MKL17Z256VFM4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL17Z256VFM4/MKL17Z256xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL17Z256VMP4">
          <compile header="fsl_device_registers.h" define="CPU_MKL17Z256VMP4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL17Z256VMP4/MKL17Z256xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL17Z256VFT4">
          <compile header="fsl_device_registers.h" define="CPU_MKL17Z256VFT4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL17Z256VFT4/MKL17Z256xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL17Z256VLH4">
          <compile header="fsl_device_registers.h" define="CPU_MKL17Z256VLH4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL17Z256VLH4/MKL17Z256xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MKL17Z256???4" Dvendor="NXP:11"/>
      <accept Dname="MKL17Z128???4" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.MKL17Z4_AND_driver.dma">
      <accept Dname="MKL17Z256???4" Dvendor="NXP:11"/>
      <accept Dname="MKL17Z128???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.MKL17Z4_AND_utility.debug_console">
      <accept Dname="MKL17Z256???4" Dvendor="NXP:11"/>
      <accept Dname="MKL17Z128???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MKL17Z4_AND_driver.common">
      <accept Dname="MKL17Z256???4" Dvendor="NXP:11"/>
      <accept Dname="MKL17Z128???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKL17Z4_AND_component.lists_AND_utility.debug_console">
      <accept Dname="MKL17Z256???4" Dvendor="NXP:11"/>
      <accept Dname="MKL17Z128???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.MKL17Z4_AND_driver.lpuart">
      <accept Dname="MKL17Z256???4" Dvendor="NXP:11"/>
      <accept Dname="MKL17Z128???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
